{
  "you-dream": "você sonha,",
  "i-create": "eu crio.",
  "just-like-that": "simples assim.",
  "fullstack-developer": "Desenvolvedora Fullstack desde 2023",
  "projects": "projetos",
  "about": "sobre",
  "contact": "contato",
  "sayHi": "dizer oi",
  "getCV": "obter cv",
  "viewLive": "Ver ao Vivo",
  "viewCode": "Ver Código",
  "what-i-do": "o que eu faço",
  "institutional-site": "site institucional",
  "institutional-site-description": "Sua empresa com uma presença profissional na internet",
  "landing-page": "landing page",
  "landing-page-description": "Páginas de captura com foco na conversão de leads e vendas",
  "blog": "blog",
  "blog-description": "Conteúdo organizado para atrair e engajar sua audiência",
  "ecommerce": "Lojas Virtuais",
  "ecommerce-description": "Lojas virtuais com design moderno e funcionalidades avançadas",
  "who-i-am": "quem sou",
  "rh-bio": "Oi, eu sou a Marina, dev fullstack com experiência em projetos acadêmicos e freelance voluntário. Minha base técnica inclui Java, Spring Boot, Javascript, React, Angular, Node.js e bancos de dados relacionais como PostgreSQL e MySQL. Tenho um perfil colaborativo e sou movida por desafios que me permitam aprender e evoluir. Atualmente, curso Engenharia de Software e atuo em um projeto voluntário de e-commerce de kimonos, o que me proporciona experiência real em desenvolvimento e trabalho em equipe. Estou sempre buscando oportunidades para aprimorar minhas habilidades, contribuir com novas soluções e agregar ao time!",
  "dev-bio": "Sou dev desde 2023 em constante aprendizado. Minha stack principal inclui Java com Spring Boot, React, Node.js e PostgreSQL, mas também tenho experiência com .NET, C# e Ruby on Rails. Já desenvolvi em TDD usando JUnit, Jest e RSpec, além de metodologias ágeis e boas práticas de desenvolvimento. Atualmente, estou envolvida em um projeto de e-commerce voluntário, onde participo como fullstack. Tenho perfil prestativo, colaborativo, curioso, aprendo rápido, sou organizada, autogerenciada, esforçada e trabalho bem em equipe.",
  "fun-bio": "🎮 Mono Kassadin no Wildrift e jungle quebra galho, 🍣 apreciadora de sushi, 📺 maratonista de séries e filmes, 🎨 desbravadora de efeitos js e css. Sempre aprendendo algo novo, seja uma tecnologia, um jogo ou um prato diferente. Bora trocar uma ideia? 😃 Melhor... bora de duo em algum joguinho?",
  "connect": "contato",
  "email": "Email: marinabarbosa.exp@gmail.com",
  "phone": "Telefone: +55 (13) 99669-7841",
  "made-in-brazil": "Feito no Brasil",
  "created-by": "Criado e codado por Marina",
  "contactModal": {
    "title": "Vamos Conectar!",
    "description": "Tem um projeto em mente? Adoraria saber mais sobre ele.",
    "form": {
      "name": {
        "placeholder": "Seu nome"
      },
      "email": {
        "placeholder": "Seu e-mail"
      },
      "message": {
        "placeholder": "Sua mensagem"
      },
      "submit": "enviar"
    },
    "close": "Fechar modal"
  },
  "cards": {
    "dev_backend": {
      "titulo": "Desenvolvimento de Software - Backend",
      "subtitulo": "Cubos Academy",
      "descricao": "Desenvolvimento Backend com JavaScript, Node.js, Express.js e PostgreSQL pela Cubos Academy em parceria com iFood."
    },
    "sharp_coders": {
      "titulo": "Treinamento Sharp Coders - Fullstack",
      "subtitulo": "Ima Tech + MXM Sistemas",
      "descricao": "Desenvolvimento Fullstack com Angular, C# e .Net pela Ímã Tech em parceria com a MXM Sistemas."
    },
    "treina_dev": {
      "titulo": "Treina Dev 12",
      "subtitulo": "Campus Code",
      "descricao": "TreinaDev 12, TDD com Ruby on Rails, RSpec, Capybara pela Campus Code."
    },
    "fullstack_junior": {
      "titulo": "Desenvolvimento Fullstack Junior",
      "subtitulo": "Mais Pra TI + Codifica Edu",
      "descricao": "Developer Fullstack Júnior com React, Design, Testes Unitários com Jest, Java, MySQL, Spring Boot, JPA, JUnit pela +PraTi em parceria com a Codifica Edu."
    },
    "software_engineering": {
      "titulo": "Engenharia de Software",
      "subtitulo": "Faculdade Unopar",
      "descricao": "Graduação em Engenharia de Software com foco em desenvolvimento fullstack, arquitetura de software, banco de dados, padrões de projeto e metodologias ágeis."
    },
    "cwi_crescer": {
      "titulo": "Formação Desenvolvedor Fullstack",
      "subtitulo": "CWI - Crescer lvl 1",
      "descricao": "Formação Fullstack com Java, JUnit, JavaScript, Jest, HTML, CSS, PostgreSQL pela CWI no programa Crescer Lvl. 1."
    }
  },
  "project-list": {
    "sprawl": {
      "name": "Sprawl – E-commerce de Kimonos",
      "description": "Atuo como Desenvolvedora Fullstack Voluntária na Sprawl, um e-commerce de kimonos, contribuindo com o desenvolvimento backend em ExpressJS e frontend em ReactJS. Participo da implementação de APIs RESTful para gerenciamento de produtos, pedidos e transações, além da criação de uma interface intuitiva para os usuários. Também colaboro na integração de funcionalidades essenciais de e-commerce, como autenticação, carrinho de compras e processamento de pedidos, além do desenvolvimento do painel administrativo para gestão de produtos, pedidos e clientes. A plataforma utiliza PostgreSQL como banco de dados e Stripe para processamento de pagamentos, garantindo eficiência e segurança nas transações."
    },
    "refood": {
      "name": "Refood",
      "description": "Refood é uma plataforma que permite que estabelecimentos comerciais vendam produtos próximos da data de validade a preços acessíveis, ajudando a reduzir o desperdício de alimentos. Como desenvolvedora fullstack, contribuí para a implementação do backend com Java 17 e Spring Boot, utilizando PostgreSQL para armazenamento de dados e Firebase para armazenamento de arquivos. No frontend, desenvolvi interfaces modernas e responsivas com React, Vite, Tailwind e Shadcn/ui. O sistema conta com autenticação segura via OAuth2 e JWT, gerenciamento de restaurantes, produtos e pedidos, integração com CEPs para entrega, além de documentação interativa da API com Swagger."
    },
    "star_bank": {
      "name": "Star Bank",
      "description": "O Star Bank é um projeto de fintech criado pela equipe Star Tech, desenvolvido para simular um ambiente de negócios real. Essa iniciativa faz parte do bootcamp Sharp Coders, oferecido pela ÍmaTech e MXM Sistemas, proporcionando uma experiência prática em desenvolvimento de software e métodos ágeis."
    },
    "catalogo_filmes": {
      "name": "Catalogo de Filmes",
      "description": "Uma aplicação de catálogo de filmes utilizando Ruby on Rails. Este projeto me permitiu consolidar os conhecimentos adquiridos ao criar rotas, models, controllers e views. A aplicação permite o gerenciamento de gêneros de filmes, diretores e os próprios filmes. Os usuários podem cadastrar, editar e visualizar informações detalhadas sobre gêneros, diretores e filmes. Além disso, a aplicação oferece funcionalidades como listar todos os gêneros e diretores, exibir todos os filmes por gênero ou diretor, e ver detalhes específicos de cada filme."
    },
    "ntt_movie_data": {
      "name": "NTT Movie Data",
      "description": "NTT Movie Data é uma aplicação SPA (Single Page Application) desenvolvida como teste de Front-End, permitindo a busca de informações detalhadas sobre filmes e séries. Além de visualizar temporadas e episódios, os usuários podem marcar títulos como favoritos. O projeto foi desenvolvido com Angular, Bootstrap e SCSS, utilizando Firebase Store para armazenamento de dados e autenticação via Google. A aplicação consome a OMDb API para exibição de informações sobre filmes e séries, e a MyMemory API para traduções automáticas de títulos e descrições."
    },
    "gerenciador_tarefas": {
      "name": "Gerenciador de Tarefas",
      "description": "Este projeto apresenta uma solução para o desafio proposto de desenvolver um sistema de gerenciamento de tarefas. Utilizando HTML, CSS, JavaScript e Bootstrap e nada mais. Além das funcionalidades básicas, foram adicionados um filtro de tarefas e uma barra de pesquisa para melhorar a usabilidade e eficiência do sistema."
    },
    "api_vendas": {
      "name": "API Vendas",
      "description": "Aplicação backend para gestão de vendas com funcionalidades para criação de cadastro de produtos, cadastro de clientes, pedidos de compras e uma completa gestão de usuários da aplicação, com autenticação via Token JWT, atualização de perfil, atualização de avatar, TypeORM, Entidades, Repositórios e outras coisas."
    },
    "mahoot": {
      "name": "Mahoot!",
      "description": "Um Quiz Game inspirado no Kahoot, desenvolvido em p5.js! Este projeto tem como objetivo proporcionar uma experiência interativa e divertida para os participantes das reuniões do Clube de leitura do curso Desenvolvimento Backend da Cubos Academy."
    }
  }
}
